translation = {
    "mail_verification_email": {
        "subject": "이메일 주소 인증",
        "text_content": """안녕하세요, @{username} 님.

Peak에 오신 것을 환영합니다!
회원가입을 완료하려면 이메일 인증이 필요합니다. 
Peak에 @{username} 님으로 로그인한 게 맞다면, 아래 링크를 클릭해서 인증하세요.

링크:
{link}

만약 본인이 시도한 게 아니라면, 위 링크를 절대 클릭하지 마세요!

본 메일 주소는 발송 전용 메일입니다.
""",
    },
    "mail_already_verified": {
        "subject": "이미 인증된 이메일",
        "text_content": """@{username} 님 안녕하세요.
        
이 이메일은 이미 인증되었습니다.
지금 Peak에서 로그인이 가능합니다.

로그인:
{link}

만약 본인이 시도한 게 아니라면, 본 메일을 무시하셔도 괜찮습니다.

본 메일 주소는 발송 전용 메일입니다.
""",
    },
    "mail_no_account": {
        "subject": "계정이 없습니다.",
        "text_content": """안녕하세요, {email} 님.

이 이메일은 Peak에 등록된 주소가 아닙니다.
Peak에 가입된 다른 메일 주소를 찾아보시거나, 회원가입하실 수 있습니다.

회원가입:
{link}

만약 본인이 시도한 게 아니라면, 본 메일을 무시하셔도 괜찮습니다.

본 메일 주소는 발송 전용 메일입니다.
""",
    },
    "mail_password_recovery": {
        "subject": "암호 재설정",
        "text_content": """@{username} 님 안녕하세요.

암호 재설정을 요청하셨습니다.
아래 링크를 눌러 암호 재설정을 시작하세요.

링크:
{link}

위 링크는 @{username} 님만의 고유한 링크입니다. 절대 남에게 알려주지 마세요!

만약 본인이 시도한 게 아니라면, 본 메일을 무시하셔도 괜찮습니다.

본 메일 주소는 발송 전용 메일입니다.
""",
    },
    "mail_already_registered": {
        "subject": "이미 가입된 이메일",
        "text_content": """안녕하세요,

{email} 주소로 가입이 시도되었으나, 이미 등록된 주소입니다.
Peak에서 로그인이 가능합니다.

로그인:
{link}

암호를 잊었다면 로그인 페이지 하단의 '암호 재설정'을 시도해주세요.

만약 본인이 시도한 게 아니라면, 본 메일을 무시하셔도 괜찮습니다.

본 메일 주소는 발송 전용 메일입니다.
""",
    },
}
